In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv('GreyAtom-Hackathon/arranged_data.csv')

In [9]:
sex = pd.get_dummies(df.sex)
sex.columns = ['Male', 'Female']
sex.head(1)

   Male  Female
0     0       1

In [10]:
df['education'].replace(6,4,inplace = True)
df['education'].replace(5,4,inplace = True)
df['education'].replace(0,4,inplace = True)

In [12]:
edu = pd.get_dummies(df.education)
edu.columns = ['grad', 'uni', 'high', 'edu_other']
edu.head(1)

   grad  uni  high  edu_other
0     0    1     0          0

In [13]:
df['marriage'].replace(0,3, inplace = True)

In [16]:
mar = pd.get_dummies(df.marriage)
mar.columns = ['married', 'single', 'others']

In [18]:
final_df = pd.concat([df, sex, edu, mar], axis=1)

In [23]:
final_df.drop('id', axis = 1, inplace = True)
final_df.drop('education', axis = 1, inplace = True)
final_df.drop('marriage', axis = 1, inplace = True)
final_df.drop('sex', axis = 1, inplace = True)
final_df.drop('Unnamed: 0', axis = 1, inplace=True)

In [24]:
final_df.head(1)

,limit_bal,age,pay_september,pay_august,pay_july,pay_june,pay_may,pay_april,bill_september,bill_august,...,default,Male,Female,grad,uni,high,edu_other,married,single,others
0,20000,24,2,2,-1,-1,-2,-2,3913,3102,...,1,0,1,0,1,0,0,1,0,0

In [25]:
final_df.to_csv('final.csv')

In [26]:
a = pd.read_csv("final.csv")

In [27]:
a.head()

,Unnamed: 0,limit_bal,age,pay_september,pay_august,pay_july,pay_june,pay_may,pay_april,bill_september,...,default,Male,Female,grad,uni,high,edu_other,married,single,others
0,0,20000,24,2,2,-1,-1,-2,-2,3913,...,1,0,1,0,1,0,0,1,0,0
1,1,120000,26,-1,2,0,0,0,2,2682,...,1,0,1,0,1,0,0,0,1,0
2,2,90000,34,0,0,0,0,0,0,29239,...,0,0,1,0,1,0,0,0,1,0
3,3,50000,37,0,0,0,0,0,0,46990,...,0,0,1,0,1,0,0,1,0,0
4,4,50000,57,-1,0,-1,0,0,0,8617,...,0,1,0,0,1,0,0,1,0,0

In [28]:
from sklearn.model_selection import StratifiedShuffleSplit
def split_strat_train_test(data, strat_key, test_ratio):
    """
    Split train and test data based on strata to get a representative train and test sets
        - data is Pandas DataFrame
        - strat_key is strata column name
    """
    split = StratifiedShuffleSplit(n_splits=1, test_size=test_ratio, random_state=42)
    for train_index, test_index in split.split(data, data[strat_key]):
        strat_train_set = data.loc[train_index]
        strat_test_set = data.loc[test_index]
    return strat_train_set, strat_test_set

In [29]:
df = pd.read_csv('final.csv')

In [30]:
train_set, test_set = split_strat_train_test(df, "default", 0.2)

In [31]:
train_set.to_csv('final_train_set.csv')

In [32]:
test_set.to_csv('final_test_set.csv')